app/views/shared/_feed_item.html.erb

SELECT * FROM "tags" INNER JOIN "microposts_tags" ON "tags".id = "microposts_tags".tag_id WHERE ("microposts_tags".micropost_id = 306 )
SELECT COUNT(*) FROM "tags" INNER JOIN "microposts_tags" ON "tags".id = "microposts_tags".tag_id WHERE ("microposts_tags".micropost_id = 305 )
---
    <div id="tagsDiv">
      <%if feed_item.tags.count > 0%>