app/views/microposts/_micropost.html.erb

SELECT * FROM "tags" INNER JOIN "microposts_tags" ON "tags".id = "microposts_tags".tag_id WHERE ("microposts_tags".micropost_id = 306 )
SELECT COUNT(*) FROM "tags" INNER JOIN "microposts_tags" ON "tags".id = "microposts_tags".tag_id WHERE ("microposts_tags".micropost_id = 305 )
---

      <%if micropost.tags.count > 0%>