app/views/microposts/tags.html.erb

<h2>Add new skills</h2>
<% if @micropost.tags.count < Tag.count then%>
---
SELECT * FROM "tags" INNER JOIN "microposts_tags" ON "tags".id = "microposts_tags".tag_id WHERE ("microposts_tags".micropost_id = 1 )
SELECT COUNT(*) FROM "tags" INNER JOIN "microposts_tags" ON "tags".id = "microposts_tags".tag_id WHERE ("microposts_tags".micropost_id = 1 )