app/controllers/categories_controller.rb

  def index
    @title = "all categories"
    @categories = Category.paginate(:page => params[:page])
---
SELECT "categories".* FROM "categories" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "categories"

  def show
    @category = Category.find(params[:id])
    @title = @category.name
    query = @category.microposts
    query = query.order("created_at DESC")
    query = query.where("location_id = ?", params[:location_id]) unless params[:location_id].blank?
    @microposts = query.all.paginate(:page => params[:page])
---
SELECT "categories".* FROM "categories" WHERE ("categories"."id" = 3) LIMIT 1
SELECT "microposts".* FROM "microposts" WHERE ("microposts".category_id = 3) ORDER BY microposts.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "microposts" WHERE ("microposts".category_id = 3)