app/controllers/locations_controller.rb

  def index
    @title = "all locations"
    @locations = Location.paginate(:page => params[:page])
---
SELECT "locations".* FROM "locations" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "locations"

  def show
    @location = Location.find(params[:id])
    @title = @location.name
    @microposts = @location.microposts.paginate(:page => params[:page])
---
SELECT "locations".* FROM "locations" WHERE ("locations"."id" = 4) LIMIT 1
SELECT "microposts".* FROM "microposts" WHERE ("microposts".location_id = 4) ORDER BY microposts.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "microposts" WHERE ("microposts".location_id = 4)