app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("title", "content", "user_id", "location_id", "category_id", "compensation", "created_at", "updated_at") VALUES ('grfgesg', '<p>fdrsgdfsghaefshgbsadfsbvaegraegfraqbh freagaregae2</p>', 1, 45, 11, 43, '2011-01-22 18:26:15.187482', '2011-01-22 18:26:15.187482')
---
  def create
    @micropost = current_user.microposts.build(params[:micropost])
    logger.debug "The object is #{params[:micropost]}"
    if @micropost.save

SELECT "microposts".* FROM "microposts" WHERE ("microposts"."id" = 303) ORDER BY microposts.created_at DESC LIMIT 1
---
  def show
    @micropost = Micropost.find(params[:id])

SELECT "microposts".* FROM "microposts" WHERE ("microposts"."id" = 1) ORDER BY microposts.created_at DESC LIMIT 1
---
  def tags
    @micropost = Micropost.find(params[:id])

SELECT "microposts".* FROM "microposts" WHERE ("microposts"."id" = 1) ORDER BY microposts.created_at DESC LIMIT 1
SELECT "tags".* FROM "tags" WHERE ("tags"."id" = 1) LIMIT 1
---
  def tag_add
    @micropost = Micropost.find(params[:id])
    @tag = Tag.find(params[:tag])

SELECT "microposts".* FROM "microposts" WHERE ("microposts"."id" = 1) ORDER BY microposts.created_at DESC LIMIT 1
SELECT "tags".* FROM "tags" WHERE ("tags"."id" = 2) LIMIT 1
---
  def tag_remove
    @micropost = Micropost.find(params[:id])
    tag_ids = params[:tags]
    unless tag_ids.blank?
      tag_ids.each do |tag_id|
        tag = Tag.find(tag_id)