app/controllers/pages_controller.rb

SELECT "microposts".* FROM "microposts" WHERE (user_id = 1) ORDER BY microposts.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "microposts" WHERE ("microposts".user_id = 1)
---
  def home
    @title = "home"
    if signed_in?
      @micropost = Micropost.new
      query = Micropost.order("created_at desc")
      unless params[:tag_id].blank? or params[:tag_id] == "Select a tag"
        tags = Tag.all
        params[:tag_id].each do |index|
          query = tags[Integer(index) - 1].microposts.order("created_at desc") & query
        end
      end
      #query = tags[Integer(params[:tag_id]) - 1].microposts.order("created_at desc") unless params[:tag_id].blank? or params[:tag_id] == "Select a tag"

      query = query.where("location_id = ?", params[:location_id]) unless params[:location_id].blank? or params[:location_id] == "Select a location"
      query = query.where("category_id = ?", params[:category_id]) unless params[:category_id].blank? or params[:category_id] == "Select a category"
      #query = query.contains("tag_id = ?", params[:tag_id]) unless params[:tag_id].blank? or params[:category_id] == "Select a tag"

      #if params[:tag_id] == "Select a tag"
        @feed_items = query.all.paginate(:page => params[:page])