app/controllers/tags_controller.rb

  def show

    @tag = Tag.find(params[:id])
    @microposts = @tag.microposts.paginate(:page => params[:page])
    @users = @tag.users.paginate(:page => params[:page])
---
SELECT "tags".* FROM "tags" WHERE ("tags"."id" = 1) LIMIT 1
SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1