app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT "microposts".* FROM "microposts" WHERE ("microposts".user_id = 1) ORDER BY microposts.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "microposts" WHERE ("microposts".user_id = 1)
SELECT * FROM "tags" INNER JOIN "microposts_tags" ON "tags".id = "microposts_tags".tag_id WHERE ("microposts_tags".micropost_id = 306 )
---
  def show
    @user = User.find(params[:id])
    @title = @user.name
    @microposts = @user.microposts.paginate(:page => params[:page])
    query = Micropost.order("created_at desc")
    @posts = []
    Micropost.all.each do |post|
      passed = true
      post.tags.each do |tag|

SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def edit
    @title = "Edit user"
    @user = User.find(params[:id])

SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def tags
    @user = User.find(params[:id])

SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT "tags".* FROM "tags" WHERE ("tags"."id" = 3) LIMIT 1
INSERT INTO "tags_users" ("user_id", "tag_id") VALUES (1, 3)
---
  def tag_add
      @user = User.find(params[:id])

    unless @selected == nil
      tags = Tag.all
     params[:tag].each do |tag|
      @tag = Tag.find(tag)
      @user.tags << @tag