app/views/categories/_category.html.erb

SELECT COUNT(*) FROM "microposts" WHERE ("microposts".category_id = 1)
---
<li>
    <%= link_to category.name, category%> (<%= category.microposts.count%>)