app/views/locations/_location.html.erb

SELECT COUNT(*) FROM "microposts" WHERE ("microposts".location_id = 1)
---
<li>
    <%= link_to location.name, location%> (<%=location.microposts.count%>)